SoapServices_Typescript/TestData/add.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>2132</tem:intA>
         <tem:intB>32232</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>